---
title: Wave
classe: Autodesk.Revit.DB.Visual.Wave
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 15
---

# Wave

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String TextureAngle { get; }` | `Wave.TextureAngle` | String |
| `String TextureLinkTextureTransforms { get; }` | `Wave.TextureLinkTextureTransforms` | String |
| `String TextureRealWorldOffsetX { get; }` | `Wave.TextureRealWorldOffsetX` | String |
| `String TextureRealWorldOffsetY { get; }` | `Wave.TextureRealWorldOffsetY` | String |
| `String TextureRealWorldOffsetZ { get; }` | `Wave.TextureRealWorldOffsetZ` | String |
| `String WaveAmplitude { get; }` | `Wave.WaveAmplitude` | String |
| `String WaveColor1 { get; }` | `Wave.WaveColor1` | String |
| `String WaveColor2 { get; }` | `Wave.WaveColor2` | String |
| `String WaveDistribution { get; }` | `Wave.WaveDistribution` | String |
| `String WaveNumWaveSets { get; }` | `Wave.WaveNumWaveSets` | String |
| `String WavePhase { get; }` | `Wave.WavePhase` | String |
| `String WaveRandomSeed { get; }` | `Wave.WaveRandomSeed` | String |
| `String WaveWaveLenMax { get; }` | `Wave.WaveWaveLenMax` | String |
| `String WaveWaveLenMin { get; }` | `Wave.WaveWaveLenMin` | String |
| `String WaveWaveRadius { get; }` | `Wave.WaveWaveRadius` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```